#Дан двумерный список чисел. Подсчитать сумму нечетных чисел в каждой строке
L = [
	[1, 2, 3, 4, 5, 6],
	[10, 21, 13, 14, 52, 63, 34],
	[2],
	[3, 2, 6],
	[35, 47],
	[-3, -2, -1, 0, 1, 2, 3, 4, 5, 6],
	[100, 200, 300, 400, 500, 600]
]
result1 = L[0:len(L):1]
print(result1)