# 6 Дана строка "English = 78 Science = 83 Math = 68 History = 65".
# Вычислить сумму всех чисел в строке.
string1 = 'English = 78 Science = 83 Math = 68 History = 65'
for
list = (string1)
print(list)
# print(sum_digits(""))
# def sum_digits(digit):