# 6 Дана строка "English = 78 Science = 83 Math = 68 History = 65".
# Вычислить сумму всех чисел в строке.
string1 = 'English = 78 Science = 83 Math = 68 History = 65'

#my_set = set(string1)
#print(my_set)
# print(sum_digits(""))
# def sum_digits(digit):
